package ForLoop;

public class NumbersFrom1To100_01 {

    public static void main(String[] args) {

        //1. Инициализираме променлива i -> отговаря за повторенията на цикъла
        //2. Записваме условие, при което ще се изпълнява цикълът
        //3. Увеличаваме стойносттан на i

        //След първоначалното завъртане на цикълът повтарящото действие е:
        //проверяваме дали условоето е вярно, изпълняваме блока от код {}, увеличаваме стойността на променливата

        for (int i = 1; i < 100 ; i++) {

            System.out.println(i);
        }
    }
}
